{
  "privacyPolicy": {
    "lastUpdated": "2024-01-31",
    "sections": [
      {
        "title": "Introduction",
        "content": "This Privacy Policy describes how BaliVisaAssist, operated by PT CIPTA SOLUSI GLOBAL (\"we\", \"us\", \"our\"), collects, uses, and protects your personal information when you use our website and services. By using our services, you agree to the collection and use of information in accordance with this policy."
      },
      {
        "title": "Information We Collect",
        "content": "We collect the following types of information:\n\n- **Personal Identification Information**: Name, email address, phone number, WhatsApp number, nationality, passport details, date of birth.\n- **Document Copies**: Passport scans, photos, educational certificates, proof of income, and other documents required for visa processing.\n- **Usage Data**: Information about how you use our website, including IP address, browser type, pages visited, and time spent on pages.\n- **Communications**: Messages you send to us via contact forms, email, or WhatsApp."
      },
      {
        "title": "How We Use Your Information",
        "content": "We use your information for the following purposes:\n\n- **Visa Processing**: To process your visa, KITAS, or PT PMA applications with Indonesian immigration authorities and government agencies.\n- **Communication**: To respond to your inquiries, send updates about your application, and provide customer support.\n- **Service Improvement**: To improve our website, services, and customer experience.\n- **Legal Compliance**: To comply with Indonesian laws and regulations related to immigration and business operations.\n- **Marketing**: With your consent, to send you promotional materials about our services (you can opt out at any time)."
      },
      {
        "title": "Information Sharing and Disclosure",
        "content": "We do not sell, trade, or rent your personal information to third parties. We may share your information with:\n\n- **Indonesian Government Agencies**: Immigration offices, Ministry of Law and Human Rights, and other relevant authorities for visa processing.\n- **Licensed Sponsors**: Our network of licensed sponsor companies for KITAS sponsorship services.\n- **Service Providers**: Third-party vendors who assist us (e.g., notaries, translators, email service providers) under strict confidentiality agreements.\n- **Legal Requirements**: When required by law, court order, or government regulation."
      },
      {
        "title": "Data Security",
        "content": "We take the security of your personal information seriously. We implement industry-standard security measures including:\n\n- Encrypted data transmission (HTTPS/SSL)\n- Secure document storage with access controls\n- Regular security audits\n- Limited employee access to personal data\n\nHowever, no method of transmission or storage is 100% secure. While we strive to protect your information, we cannot guarantee absolute security."
      },
      {
        "title": "Data Retention",
        "content": "We retain your personal information for as long as necessary to fulfill the purposes outlined in this Privacy Policy, unless a longer retention period is required by law. Visa application documents are typically retained for 5 years for compliance and record-keeping purposes."
      },
      {
        "title": "Your Rights",
        "content": "You have the right to:\n\n- Access the personal information we hold about you\n- Request correction of inaccurate information\n- Request deletion of your information (subject to legal retention requirements)\n- Withdraw consent for marketing communications\n- Lodge a complaint with relevant data protection authorities\n\nTo exercise these rights, please contact us at info@balivisaassist.com."
      },
      {
        "title": "Cookies and Tracking",
        "content": "Our website uses cookies and similar tracking technologies to improve user experience and analyze website traffic. We use:\n\n- **Essential Cookies**: Required for website functionality\n- **Analytics Cookies**: Google Analytics to understand website usage (anonymized data)\n- **Marketing Cookies**: Meta Pixel for advertising purposes (with your consent)\n\nYou can control cookies through your browser settings."
      },
      {
        "title": "Third-Party Links",
        "content": "Our website may contain links to third-party websites. We are not responsible for the privacy practices of these external sites. We encourage you to review their privacy policies before providing any personal information."
      },
      {
        "title": "Changes to This Privacy Policy",
        "content": "We may update this Privacy Policy from time to time. Changes will be posted on this page with an updated \"Last Updated\" date. Continued use of our services after changes constitutes acceptance of the updated policy."
      },
      {
        "title": "Contact Us",
        "content": "If you have any questions about this Privacy Policy, please contact us:\n\nPT CIPTA SOLUSI GLOBAL (BaliVisaAssist)\nEmail: info@balivisaassist.com\nWhatsApp: [Your WhatsApp Number]"
      }
    ]
  },
  "termsOfService": {
    "lastUpdated": "2024-01-31",
    "sections": [
      {
        "title": "Agreement to Terms",
        "content": "By accessing and using the BaliVisaAssist website and services, you agree to be bound by these Terms of Service. BaliVisaAssist is operated by PT CIPTA SOLUSI GLOBAL, a company registered in Indonesia. If you do not agree to these terms, please do not use our services."
      },
      {
        "title": "Description of Services",
        "content": "BaliVisaAssist provides visa assistance and sponsorship services for individuals and businesses seeking to obtain visas, KITAS (limited stay permits), work permits, and company setup (PT PMA) in Indonesia. Our services include:\n\n- Visa application consultation and guidance\n- Document preparation and submission\n- Sponsorship services for KITAS applications\n- Liaison with Indonesian immigration authorities\n- PT PMA company registration and setup\n- Ongoing compliance and renewal support"
      },
      {
        "title": "Important Disclaimer: Not a Government Agency",
        "content": "BaliVisaAssist is NOT affiliated with, endorsed by, or part of the Indonesian government or any government immigration agency. We are a private visa assistance company. All visa applications are subject to approval by Indonesian immigration authorities. We cannot guarantee visa approval, as final decisions are made solely by the Indonesian government."
      },
      {
        "title": "Eligibility and Requirements",
        "content": "To use our services, you must:\n\n- Be at least 18 years of age (or have parental/guardian consent)\n- Provide accurate and truthful information\n- Meet the eligibility requirements for the visa type you are applying for\n- Comply with all Indonesian immigration laws and regulations\n\nWe reserve the right to refuse service to anyone who does not meet eligibility requirements or provides false information."
      },
      {
        "title": "Fees and Payment",
        "content": "Prices displayed on our website are \"starting from\" prices and may vary based on:\n\n- Your nationality\n- Processing time (standard vs. expedited)\n- Specific visa requirements\n- Number of dependents\n- Additional services requested\n\nAll prices include government fees, processing fees, and our service fees unless otherwise stated. We will provide an exact quote before you commit to our services. Payment terms will be agreed upon during the consultation process.\n\nRefunds are handled on a case-by-case basis and depend on the stage of your application. Government fees are generally non-refundable once submitted."
      },
      {
        "title": "Client Responsibilities",
        "content": "You are responsible for:\n\n- Providing accurate, complete, and truthful information\n- Submitting required documents in a timely manner\n- Maintaining a valid passport with sufficient validity\n- Complying with Indonesian immigration laws during your stay\n- Informing us immediately of any changes to your circumstances\n- Responding to our requests for additional information promptly\n\nFailure to fulfill these responsibilities may result in delays or rejection of your application, for which we cannot be held liable."
      },
      {
        "title": "No Guarantee of Approval",
        "content": "We provide professional assistance to maximize your chances of visa approval. However, we CANNOT and DO NOT guarantee visa approval. All visa decisions are made by Indonesian immigration authorities based on their assessment of your application.\n\nWe will only proceed with applications that meet the basic eligibility criteria. If we believe your application is unlikely to succeed, we will advise you accordingly."
      },
      {
        "title": "Processing Times",
        "content": "Processing times provided are estimates based on typical government processing speeds. Actual processing times may vary due to factors beyond our control, including:\n\n- Government backlogs or holidays\n- Additional document requests from authorities\n- Policy changes or new regulations\n- Force majeure events (natural disasters, pandemics, political events)\n\nWe are not liable for delays caused by government processing times or events beyond our control."
      },
      {
        "title": "Compliance and Legal Obligations",
        "content": "By using our services, you agree to:\n\n- Comply with all Indonesian laws and regulations\n- Use your visa only for the purposes stated in your application\n- Not engage in prohibited activities (unauthorized employment, overstaying, etc.)\n- Report any changes of address or status to immigration authorities as required\n\nViolations of Indonesian immigration law may result in fines, deportation, or bans from re-entering Indonesia. We are not responsible for legal consequences resulting from your non-compliance."
      },
      {
        "title": "Intellectual Property",
        "content": "All content on the BaliVisaAssist website, including text, graphics, logos, and software, is the property of PT CIPTA SOLUSI GLOBAL or its licensors and is protected by intellectual property laws. You may not reproduce, distribute, or use any content without our written permission."
      },
      {
        "title": "Limitation of Liability",
        "content": "To the maximum extent permitted by law, PT CIPTA SOLUSI GLOBAL (BaliVisaAssist) shall not be liable for:\n\n- Visa application rejections by Indonesian authorities\n- Delays in processing beyond our control\n- Indirect, incidental, or consequential damages\n- Loss of income, business opportunities, or travel plans due to visa delays or rejections\n- Actions or decisions made by Indonesian government agencies\n\nOur total liability to you for any claim arising from our services shall not exceed the amount you paid us for those services."
      },
      {
        "title": "Indemnification",
        "content": "You agree to indemnify and hold harmless PT CIPTA SOLUSI GLOBAL, its employees, and agents from any claims, damages, or expenses arising from:\n\n- Your violation of these Terms of Service\n- Your violation of Indonesian immigration laws\n- False or misleading information provided by you\n- Your use of our services"
      },
      {
        "title": "Termination",
        "content": "We reserve the right to terminate or suspend our services to you at any time if:\n\n- You violate these Terms of Service\n- You provide false or misleading information\n- You fail to pay agreed fees\n- We determine that continuing the service relationship is not in our best interest\n\nUpon termination, you remain responsible for any outstanding fees owed."
      },
      {
        "title": "Changes to Terms",
        "content": "We may update these Terms of Service from time to time. Changes will be posted on this page with an updated \"Last Updated\" date. Continued use of our services after changes constitutes acceptance of the updated terms."
      },
      {
        "title": "Governing Law and Dispute Resolution",
        "content": "These Terms of Service are governed by the laws of Indonesia. Any disputes arising from these terms or our services shall be resolved through:\n\n1. Good faith negotiation between the parties\n2. If negotiation fails, mediation in Bali, Indonesia\n3. If mediation fails, jurisdiction shall be in the courts of Bali, Indonesia"
      },
      {
        "title": "Contact Information",
        "content": "For questions about these Terms of Service or our services, please contact:\n\nPT CIPTA SOLUSI GLOBAL (BaliVisaAssist)\nEmail: info@balivisaassist.com\nWhatsApp: [Your WhatsApp Number]"
      }
    ]
  }
}
